In [7]:
import numpy as np

array = np.array(range(21))

In [8]:
array + 5 # different from Python

array([ 5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21,
       22, 23, 24, 25])

In [9]:
array + array # different from Python

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32,
       34, 36, 38, 40])

In [10]:
array[6:10] = 66 # different from Python
array

array([ 0,  1,  2,  3,  4,  5, 66, 66, 66, 66, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20])

In [13]:
array[6:10] = [6, 7, 8, 9]
array

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20])

In [15]:
vector = np.arange(10)
sum(vector<5)

np.int64(5)

In [17]:
import numpy as np
import pandas as pd

header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']

df = pd.DataFrame(data)

display(df)

df[0]

    0   1   2
0  69  72  76
1  66  69  86
2  93  73  87
3  66  69  80

0    69
1    66
2    93
3    66
Name: 0, dtype: int64

In [18]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']

df = pd.DataFrame(data, index=students)

display(df)

df[0]

           0   1   2
student1  71  92  89
student2  98  84  75
student3  84  73  93
student4  81  72  65

student1    71
student2    98
student3    84
student4    81
Name: 0, dtype: int64

In [22]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']

df = pd.DataFrame(data, columns=header, index=students)

display(df)

df['exam1']

          exam1  exam2  exam3
student1     95     91     66
student2     72     83     99
student3     92     70     96
student4     84     68     95

student1    95
student2    72
student3    92
student4    84
Name: exam1, dtype: int64

In [37]:
df['average'] = ((df['exam1'] + df['exam2'] + df['exam3'])/3).round().astype(int)
display(df)

          exam1  exam2  exam3  average
student1     95     91     66       84
student2     72     83     99       85
student3     92     70     96       86
student4     84     68     95       82

In [29]:
df['average']

student1    84
student2    85
student3    86
student4    82
Name: average, dtype: int64

In [30]:
df.average

student1    84
student2    85
student3    86
student4    82
Name: average, dtype: int64

In [32]:
df.drop('average', axis=1)

          exam1  exam2  exam3
student1     95     91     66
student2     72     83     99
student3     92     70     96
student4     84     68     95

In [33]:
df

          exam1  exam2  exam3  average
student1     95     91     66       84
student2     72     83     99       85
student3     92     70     96       86
student4     84     68     95       82

In [38]:
df.drop('average', axis=1, inplace=True)
display(df)

          exam1  exam2  exam3
student1     95     91     66
student2     72     83     99
student3     92     70     96
student4     84     68     95

In [39]:
df.drop('student1')

          exam1  exam2  exam3
student2     72     83     99
student3     92     70     96
student4     84     68     95

In [41]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, index=students, columns=header)

df.loc['student1']

exam1    97
exam2    81
exam3    75
Name: student1, dtype: int64

In [42]:
df.iloc[0]

exam1    97
exam2    81
exam3    75
Name: student1, dtype: int64

In [45]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, columns=header)
display(df)
df.loc[0]

   exam1  exam2  exam3
0     96     70     82
1     96     79    100
2     84     93     95
3     75     91     87

exam1    96
exam2    70
exam3    82
Name: 0, dtype: int64

In [46]:
df.iloc[0]

exam1    96
exam2    70
exam3    82
Name: 0, dtype: int64

In [48]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, columns=header, index=students)
display(df)
df.loc['student1']

          exam1  exam2  exam3
student1     85     98     78
student2     65     95     71
student3     66     72     66
student4     71     97     65

exam1    85
exam2    98
exam3    78
Name: student1, dtype: int64

In [49]:
df.iloc[3]

exam1    71
exam2    97
exam3    65
Name: student4, dtype: int64

In [51]:
import pandas as pd
columns = ('StudentName', 'E1', 'E2', 'E3', 'E4','E5')
df = pd.DataFrame(data=[ele.strip().split(',') for ele in open('testdata_1.txt')], columns=columns)
display(df)

  StudentName   E1  E2  E3  E4  E5
0    student1   92  77  87  77  94
1    student2   74  93  88  67  85
2    student3   83  96  74  79  92
3    student4  100  72  83  85  66
4    student5   77  96  66  79  92
5    student6  100  86  84  70  71
6    student7   66  91  94  97  80
7    student8   97  86  75  69  88
8    student9   95  98  99  85  86
9   student10   78  76  73  88  86

In [52]:
df['StudentName']

0     student1
1     student2
2     student3
3     student4
4     student5
5     student6
6     student7
7     student8
8     student9
9    student10
Name: StudentName, dtype: object

In [53]:
df[['StudentName', 'E1']]

  StudentName   E1
0    student1   92
1    student2   74
2    student3   83
3    student4  100
4    student5   77
5    student6  100
6    student7   66
7    student8   97
8    student9   95
9   student10   78

In [54]:
df[('StudentName', 'E1')]

KeyError: ('StudentName', 'E1')

In [55]:
df[1:5]

  StudentName   E1  E2  E3  E4  E5
1    student2   74  93  88  67  85
2    student3   83  96  74  79  92
3    student4  100  72  83  85  66
4    student5   77  96  66  79  92

In [56]:
df[1:5, ['E1', 'E2']]

InvalidIndexError: (slice(1, 5, None), ['E1', 'E2'])

In [57]:
df[1:5, 1:5]

InvalidIndexError: (slice(1, 5, None), slice(1, 5, None))

In [59]:
x = np.array([1, 2, 3, 4])
x.sum()

np.int64(10)

In [61]:
df.iloc[0]

StudentName    student1
E1                   92
E2                   77
E3                   87
E4                   77
E5                   94
Name: 0, dtype: object

In [63]:
df.iloc[[0, 1, 4]] # ==> df.iloc[[0, 1, 2], :]

  StudentName  E1  E2  E3  E4  E5
0    student1  92  77  87  77  94
1    student2  74  93  88  67  85
4    student5  77  96  66  79  92

In [64]:
df.iloc[[0, 1, 2], :]

  StudentName  E1  E2  E3  E4  E5
0    student1  92  77  87  77  94
1    student2  74  93  88  67  85
2    student3  83  96  74  79  92

In [65]:
df.iloc[[0, 1, 2], [0, 1]]

  StudentName  E1
0    student1  92
1    student2  74
2    student3  83

In [66]:
df.iloc[0:3]

  StudentName  E1  E2  E3  E4  E5
0    student1  92  77  87  77  94
1    student2  74  93  88  67  85
2    student3  83  96  74  79  92

In [67]:
df.iloc[:, [1, 2]]

    E1  E2
0   92  77
1   74  93
2   83  96
3  100  72
4   77  96
5  100  86
6   66  91
7   97  86
8   95  98
9   78  76

In [68]:
df.iloc[0:3, 1:3]

   E1  E2
0  92  77
1  74  93
2  83  96

In [71]:
import pandas as pd
columns = ('StudentName', 'E1', 'E2', 'E3', 'E4','E5')
df = pd.DataFrame(data=[ele.strip().split(',') for ele in open('testdata_1.txt')], columns=columns)
df.loc[3]
df

  StudentName   E1  E2  E3  E4  E5
0    student1   92  77  87  77  94
1    student2   74  93  88  67  85
2    student3   83  96  74  79  92
3    student4  100  72  83  85  66
4    student5   77  96  66  79  92
5    student6  100  86  84  70  71
6    student7   66  91  94  97  80
7    student8   97  86  75  69  88
8    student9   95  98  99  85  86
9   student10   78  76  73  88  86

In [89]:
import pandas as pd
columns = ('StudentName', 'E1', 'E2', 'E3', 'E4','E5')
df = pd.DataFrame(data=[ele.strip().split(',') for ele in open('testdata_1.txt')], columns=columns)
df.set_index(df['StudentName'], inplace=True) 
df.drop('StudentName', axis=1, inplace=True)
df

              E1  E2  E3  E4  E5
StudentName
student1      92  77  87  77  94
student2      74  93  88  67  85
student5      77  96  66  79  92
student3      83  96  74  79  92
student4     100  72  83  85  66
student6     100  86  84  70  71
student7      66  91  94  97  80
student8      97  86  75  69  88
student9      95  98  99  85  86
student10     78  76  73  88  86

In [74]:
df.loc['student10']

E1    78
E2    76
E3    73
E4    88
E5    86
Name: student10, dtype: object

In [75]:
df.loc[['student4', 'student1']]

              E1  E2  E3  E4  E5
StudentName
student4     100  72  83  85  66
student1      92  77  87  77  94

In [76]:
df.loc[['student4', 'student1'], ['E1', 'E2']]

              E1  E2
StudentName
student4     100  72
student1      92  77

In [77]:
df.loc[:, ['E1', 'E2']]

              E1  E2
StudentName
student1      92  77
student2      74  93
student3      83  96
student4     100  72
student5      77  96
student6     100  86
student7      66  91
student8      97  86
student9      95  98
student10     78  76

In [78]:
df.loc[['student1', 'student2'], :]

             E1  E2  E3  E4  E5
StudentName
student1     92  77  87  77  94
student2     74  93  88  67  85

In [88]:
df.loc['student2':'student5', :]

KeyError: 'student5'

In [82]:
df.loc[:, 'E1':'E4']

              E1  E2  E3  E4
StudentName
student1      92  77  87  77
student2      74  93  88  67
student3      83  96  74  79
student4     100  72  83  85
student5      77  96  66  79
student6     100  86  84  70
student7      66  91  94  97
student8      97  86  75  69
student9      95  98  99  85
student10     78  76  73  88

In [92]:
import pandas as pd
columns = ('StudentName', 'E1', 'E2', 'E3', 'E4','E5')
df = pd.DataFrame(data=[ele.strip().split(',') for ele in open('testdata_1.txt')], columns=columns)
display(df)
for idx, row in df.iterrows():
    print(idx)
    print(row)

  StudentName   E1  E2  E3  E4  E5
0    student1   92  77  87  77  94
1    student2   74  93  88  67  85
2    student5   77  96  66  79  92
3    student3   83  96  74  79  92
4    student4  100  72  83  85  66
5    student6  100  86  84  70  71
6    student7   66  91  94  97  80
7    student8   97  86  75  69  88
8    student9   95  98  99  85  86
9   student10   78  76  73  88  86

0
StudentName    student1
E1                   92
E2                   77
E3                   87
E4                   77
E5                   94
Name: 0, dtype: object
1
StudentName    student2
E1                   74
E2                   93
E3                   88
E4                   67
E5                   85
Name: 1, dtype: object
2
StudentName    student5
E1                   77
E2                   96
E3                   66
E4                   79
E5                   92
Name: 2, dtype: object
3
StudentName    student3
E1                   83
E2                   96
E3                   74
E4                   79
E5                   92
Name: 3, dtype: object
4
StudentName    student4
E1                  100
E2                   72
E3                   83
E4                   85
E5                   66
Name: 4, dtype: object
5
StudentName    student6
E1                  100
E2                   86
E3                   84
E4                   70
E5                   71
Name: 5, dtype: object
6
StudentName    student7
E1                   66
E2                   91
E3                   94
E4                   97
E5                   80
Name: 6, dtype: object
7
StudentName    student8
E1                   97
E2                   86
E3                   75
E4                   69
E5                   88
Name: 7, dtype: object
8
StudentName    student9
E1                   95
E2                   98
E3                   99
E4                   85
E5                   86
Name: 8, dtype: object
9
StudentName    student10
E1                    78
E2                    76
E3                    73
E4                    88
E5                    86
Name: 9, dtype: object

In [93]:
import pandas as pd
columns = ('StudentName', 'E1', 'E2', 'E3', 'E4','E5')
df = pd.DataFrame(data=[ele.strip().split(',') for ele in open('testdata_1.txt')], columns=columns)
for column_name, column in df.items():
    print(column_name)
    print(column)

StudentName
0     student1
1     student2
2     student5
3     student3
4     student4
5     student6
6     student7
7     student8
8     student9
9    student10
Name: StudentName, dtype: object
E1
0     92
1     74
2     77
3     83
4    100
5    100
6     66
7     97
8     95
9     78
Name: E1, dtype: object
E2
0    77
1    93
2    96
3    96
4    72
5    86
6    91
7    86
8    98
9    76
Name: E2, dtype: object
E3
0    87
1    88
2    66
3    74
4    83
5    84
6    94
7    75
8    99
9    73
Name: E3, dtype: object
E4
0    77
1    67
2    79
3    79
4    85
5    70
6    97
7    69
8    85
9    88
Name: E4, dtype: object
E5
0    94
1    85
2    92
3    92
4    66
5    71
6    80
7    88
8    86
9    86
Name: E5, dtype: object

In [94]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, index=students, columns=header)
display(df)

          exam1  exam2  exam3
student1     77     99     68
student2     66     75     65
student3     84     76     96
student4     99     91     87

In [95]:
df.loc['student1', 'exam1']

np.int64(77)

In [96]:
df.loc[['student1', 'student3'], ['exam1', 'exam3']]

          exam1  exam3
student1     77     68
student3     84     96

In [97]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, index=students, columns=header)
display(df)
df >= 90
df[df>=90]

          exam1  exam2  exam3
student1     93     93     82
student2     85     68     96
student3     75     70     88
student4     91     72     90

          exam1  exam2  exam3
student1   93.0   93.0    NaN
student2    NaN    NaN   96.0
student3    NaN    NaN    NaN
student4   91.0    NaN   90.0

In [98]:
df['exam1']>=85 #

student1     True
student2     True
student3    False
student4     True
Name: exam1, dtype: bool

In [99]:
df[df['exam1']>=85]

          exam1  exam2  exam3
student1     93     93     82
student2     85     68     96
student4     91     72     90

In [100]:
df[df['exam1']>=85]['exam3']

student1    82
student2    96
student4    90
Name: exam3, dtype: int64

In [101]:
df[df['exam1']>=85][['exam2', 'exam3']]

          exam2  exam3
student1     93     82
student2     68     96
student4     72     90

In [102]:
df[(df['exam1']>=85) & (df['exam2']>=85)]

          exam1  exam2  exam3
student1     93     93     82

In [103]:
df[(df['exam1']>=85) & (df['exam2']>=85)]['exam3']

student1    82
Name: exam3, dtype: int64

In [104]:
df[(df['exam1']>=85) | (df['exam2']>=85)]

          exam1  exam2  exam3
student1     93     93     82
student2     85     68     96
student4     91     72     90

In [105]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, columns=header)
df['name'] = students

In [106]:
df

   exam1  exam2  exam3      name
0     72     95     87  student1
1     69     98     94  student2
2     88     72     97  student3
3     65     74     75  student4

In [107]:
df.set_index('name', inplace=True)
df.loc['student1']

exam1    72
exam2    95
exam3    87
Name: student1, dtype: int64

In [108]:
df

          exam1  exam2  exam3
name
student1     72     95     87
student2     69     98     94
student3     88     72     97
student4     65     74     75

In [109]:
df.reset_index(inplace=True)
df

       name  exam1  exam2  exam3
0  student1     72     95     87
1  student2     69     98     94
2  student3     88     72     97
3  student4     65     74     75

In [110]:
df.loc['student1']

KeyError: 'student1'

In [120]:
students = 'student1 student1 student1 student2 student2 student2 student3 student3 student3'
exams = 'exam1 exam2 exam3'.split()*3
classes = 'class1 class2'
index = list(zip(students.split(), exams))
index = pd.MultiIndex.from_tuples(index)
df = pd.DataFrame(np.random.randint(65, 101, 3*3*2).reshape(9,2) , index, classes.split())

df

                class1  class2
student1 exam1      82      66
         exam2     100      80
         exam3      78      86
student2 exam1      95     100
         exam2      86      96
         exam3      68      92
student3 exam1      83      96
         exam2      91      76
         exam3      92      84

In [117]:
import pandas as pd
import numpy as np

# Prepare the data
students = 'student1 student1 student1 student2 student2 student2 student3 student3 student3'
exams = 'exam1 exam2 exam3'.split()*3
classes = 'class1 class2'
index = list(zip(students.split(), exams))
index = pd.MultiIndex.from_tuples(index)
df = pd.DataFrame(np.random.randint(65, 101, 3*3*2).reshape(9, 2), index, classes.split())

# Apply conditional formatting to color cells with values greater than 80
styled_df = df.style.applymap(lambda x: 'background-color: green' if x > 80 else '', subset=pd.IndexSlice[:, :])

styled_df

/tmp/ipykernel_501/3692207161.py:13: FutureWarning: Styler.applymap has been deprecated. Use Styler.map instead.
  styled_df = df.style.applymap(lambda x: 'background-color: green' if x > 80 else '', subset=pd.IndexSlice[:, :])

In [113]:
df.loc['student1'].loc['exam1']

class1    75
class2    83
Name: exam1, dtype: int64

In [114]:
df.index.names

FrozenList([None, None])

In [115]:
df.index.names = ['Students', 'Exams']
df

                class1  class2
Students Exams
student1 exam1      75      83
         exam2      81      69
         exam3      67      93
student2 exam1      65      99
         exam2      84      84
         exam3      75      67
student3 exam1      94      70
         exam2      84      94
         exam3      87      86

In [121]:
df.xs('student1')

       class1  class2
exam1      82      66
exam2     100      80
exam3      78      86

In [122]:
df.xs('exam1', level='Exams')

KeyError: 'Level Exams not found'

In [127]:
students = 'student1 student1 student1 student2 student2 student2 student3 student3 student3'
exams = 'exam1 exam2 exam3'.split()*3
classes = 'class1 class2'
index = list(zip(students.split(), exams))
index = pd.MultiIndex.from_tuples(index)
df = pd.DataFrame(np.random.randint(65, 101, 3*3*2).reshape(9,2) , index, classes.split())
df.loc['student1'].loc['exam1']['class1'] 
df.index.names
df.index.names = ['Students', 'Exams']
display(df)
## cross-section
# df.xs('student1')
df.xs('exam1', level='Exams')

                class1  class2
Students Exams
student1 exam1      70      83
         exam2      77      67
         exam3      73      74
student2 exam1      68      71
         exam2      73      73
         exam3      89      83
student3 exam1      66      81
         exam2      84      70
         exam3      70      95

          class1  class2
Students
student1      70      83
student2      68      71
student3      66      81

In [128]:
my_dict = {'student1': [90, 84, np.nan], 'student2': [77, np.nan, np.nan], 'student3': [88, 65, 93]}
df = pd.DataFrame(my_dict)
df

   student1  student2  student3
0      90.0      77.0        88
1      84.0       NaN        65
2       NaN       NaN        93

In [129]:
df.dropna()

   student1  student2  student3
0      90.0      77.0        88

In [130]:
df.dropna(axis=0)

   student1  student2  student3
0      90.0      77.0        88

In [131]:
df.dropna(axis=1)

   student3
0        88
1        65
2        93

In [132]:
df.dropna(thresh=2)

   student1  student2  student3
0      90.0      77.0        88
1      84.0       NaN        65

In [133]:
df.fillna(value=55)

   student1  student2  student3
0      90.0      77.0        88
1      84.0      55.0        65
2      55.0      55.0        93

In [134]:
df.drop(axis=0, labels=[1,2])

   student1  student2  student3
0      90.0      77.0        88

In [135]:
df.drop(axis=1, columns=['student1'])

   student2  student3
0      77.0        88
1       NaN        65
2       NaN        93

In [150]:
my_dict = {
    'Exams': 'exam1 exam1 exam1'.split() + 'exam2 exam2 exam2'.split() + 'exam3 exam3 exam3'.split(),
    'Students': 'student1 student2 student3'.split()*3,   
    'Scores': np.random.randint(65,101,9),
    'Scores2': np.random.randint(65,101,9)
}
df = pd.DataFrame(my_dict)
df

   Exams  Students  Scores  Scores2
0  exam1  student1      96       71
1  exam1  student2      71       65
2  exam1  student3      86       86
3  exam2  student1      72       74
4  exam2  student2      66       98
5  exam2  student3      86       86
6  exam3  student1      80       70
7  exam3  student2      66       79
8  exam3  student3      99       97

In [155]:
(71 + 74 + 70) / 3

71.66666666666667

In [159]:
df.groupby('Students')['Scores2'].mean()

TypeError: agg function failed [how->mean,dtype->object]

In [156]:
df.groupby('Students')['Scores2'].mean().loc['student1']

np.float64(71.66666666666667)

In [163]:
df.groupby('Students')['Scores'].max()

Students
student1    96
student2    71
student3    99
Name: Scores, dtype: int64

In [165]:
df.groupby('Students').describe()

         Scores                                                     Scores2  \
          count       mean        std   min   25%   50%   75%   max   count
Students
student1    3.0  82.666667  12.220202  72.0  76.0  80.0  88.0  96.0     3.0
student2    3.0  67.666667   2.886751  66.0  66.0  66.0  68.5  71.0     3.0
student3    3.0  90.333333   7.505553  86.0  86.0  86.0  92.5  99.0     3.0


               mean        std   min   25%   50%   75%   max
Students
student1  71.666667   2.081666  70.0  70.5  71.0  72.5  74.0
student2  80.666667  16.563011  65.0  72.0  79.0  88.5  98.0
student3  89.666667   6.350853  86.0  86.0  86.0  91.5  97.0

In [169]:
df.groupby('Students', axis=1).mean()

/tmp/ipykernel_501/2478218130.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  df.groupby('Students', axis=1).mean()

IndexError: agg function failed [how->mean,dtype->object]